results/fio-test1-10pods-30k-5050-4kb/fio-benchmark-4.log
Starting FIO benchmark on pod 4...
FIO Configuration:
[global]
ioengine=libaio
direct=1
size=10G
runtime=600
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=32

[test1-30k-5050-4k]
rw=randrw
rwmixread=50
bs=4k
# 10 pods * 3000 = 30K total IOPS. Since numjobs=8, rate_iops is per job or total for the block?
# In group reporting with numjobs, rate_iops is per-job. We want 3000 total across 8 jobs.
# 3000 / 8 = 375 IOPS per thread (approx)
rate_iops=3750
---
test1-30k-5050-4k: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.41
Starting 8 processes
test1-30k-5050-4k: Laying out IO file (1 file / 10240MiB)
test1-30k-5050-4k: Laying out IO file (1 file / 10240MiB)
test1-30k-5050-4k: Laying out IO file (1 file / 10240MiB)
[...]

test1-30k-5050-4k: (groupid=0, jobs=8): err= 0: pid=79: Thu Sep  3 10:12:27 2026
  read: IOPS=28.9k, BW=113MiB/s (118MB/s)(66.0GiB/600002msec)
    slat (nsec): min=1471, max=598054, avg=7846.12, stdev=5465.24
    clat (usec): min=167, max=693684, avg=4411.19, stdev=1922.01
     lat (usec): min=171, max=693688, avg=4419.03, stdev=1922.03
    clat percentiles (usec):
     |  1.00th=[ 1778],  5.00th=[ 3589], 10.00th=[ 3785], 20.00th=[ 3982],
     | 30.00th=[ 4113], 40.00th=[ 4228], 50.00th=[ 4359], 60.00th=[ 4490],
     | 70.00th=[ 4621], 80.00th=[ 4752], 90.00th=[ 5145], 95.00th=[ 5735],
     | 99.00th=[ 6456], 99.50th=[ 6718], 99.90th=[ 7898], 99.95th=[ 9110],
     | 99.99th=[18220]
   bw (  KiB/s): min=53448, max=295976, per=99.91%, avg=115302.55, stdev=1647.49, samples=9592
   iops        : min=13362, max=73994, avg=28825.60, stdev=411.87, samples=9592
  write: IOPS=28.8k, BW=113MiB/s (118MB/s)(66.0GiB/600002msec); 0 zone resets
    slat (nsec): min=1847, max=1937.2k, avg=8201.47, stdev=5464.20
    clat (usec): min=193, max=693904, avg=4446.03, stdev=1793.74
     lat (usec): min=196, max=693909, avg=4454.23, stdev=1793.77
    clat percentiles (usec):
     |  1.00th=[ 1795],  5.00th=[ 3621], 10.00th=[ 3818], 20.00th=[ 4047],
     | 30.00th=[ 4178], 40.00th=[ 4293], 50.00th=[ 4424], 60.00th=[ 4490],
     | 70.00th=[ 4621], 80.00th=[ 4817], 90.00th=[ 5145], 95.00th=[ 5735],
     | 99.00th=[ 6521], 99.50th=[ 6718], 99.90th=[ 7767], 99.95th=[ 8848],
     | 99.99th=[17433]
   bw (  KiB/s): min=53360, max=298688, per=99.91%, avg=115241.12, stdev=1664.12, samples=9592
   iops        : min=13340, max=74672, avg=28810.25, stdev=416.03, samples=9592
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.02%, 1000=0.04%
  lat (msec)   : 2=1.26%, 4=17.84%, 10=80.80%, 20=0.03%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=1.21%, sys=6.95%, ctx=31122758, majf=0, minf=3384
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=17311125,17302188,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=113MiB/s (118MB/s), 113MiB/s-113MiB/s (118MB/s-118MB/s), io=66.0GiB (70.9GB), run=600002-600002msec
  WRITE: bw=113MiB/s (118MB/s), 113MiB/s-113MiB/s (118MB/s-118MB/s), io=66.0GiB (70.9GB), run=600002-600002msec
FIO benchmark completed on pod 4